{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"rescaling_1_input": {"name": "rescaling_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/rescaling_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/rescaling_1/Cast_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30976"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "rescaling_1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential/rescaling_1/mul", "op": "Mul", "input": ["rescaling_1_input", "StatefulPartitionedCall/sequential/rescaling_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/rescaling_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/rescaling_1/mul", "StatefulPartitionedCall/sequential/rescaling_1/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/rescaling_1/add", "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/rescaling_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/rescaling_1/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [30976, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [128, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}